#include "dnet.h"
/*
=======================================================================================================================
Libdnet头文件
=======================================================================================================================
 */
int main()
{
    eth_t *handle;
    /* 以太网协议句柄 */
    u_char content[IP_LEN_MAX] = "\x11\x11\x11\x11\x11\x11\x11\x11\x11\x11\x11\x11\x11\x11\";
    /* 以太网协议数据，以十六进制进行显示
     * */
    int length = 14;
    /* 以太网协议的长度 */
    handle = eth_open("eth0");
    /* 打开以太网协议操作 */
    eth_send(handle,  /* 以太网协议句柄 */content,  /* 数据包内容 */length); /* 长度 */
    /* 发送以太网协议数据 */
    eth_close(handle);
    /* 关闭以太网协议操作 */
}
